; domain
(define (domain dntp)
  (:requirements :strips :typing :equality :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions)
  (:types
    node - object
    primary secondary - node
  )
  (:predicates
    (conn  ?x - node ?y - node)
    (close ?x - node ?y - node)
    (rem   ?x - node ?y - node)
    (full  ?x - secondary)
    (buildable ?x - node ?y - node)
    (mutable   ?x - node ?y - node)
    (le        ?x - node ?y - node)
  )

  (:action insP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (buildable ?s ?p) (not (conn ?s ?p)) (not (rem ?s ?p)) (not (full ?s)))
    :effect (and (conn ?s ?p) (not (close ?s ?p)) (full ?s)))
  (:action insS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (buildable ?s1 ?s2) (not (conn ?s1 ?s2)) (not (rem ?s1 ?s2)) (not (full ?s1)) (not (full ?s2)))
    :effect (and (conn ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2)))
  (:action delP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (conn ?s ?p) (mutable ?s ?p) (not (close ?s ?p)) (full ?s))
    :effect (and (not (conn ?s ?p)) (rem ?s ?p) (not (full ?s))))
  (:action delS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (conn ?s1 ?s2) (mutable ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2))
    :effect (and (not (conn ?s1 ?s2)) (rem ?s1 ?s2) (not (full ?s1)) (not (full ?s2))))
  (:action sw
    :parameters (?u - secondary ?v - node ?vp - node)
    :precondition (and (not (= ?u ?v)) (not (= ?u ?vp)) (not (= ?v ?vp))
      (imply (le ?u ?v)  (and (conn ?u ?v) (close ?u ?v)))
      (imply (le ?v ?u)  (and (conn ?v ?u) (close ?v ?u)))
      (imply (le ?u ?vp) (and (conn ?u ?vp) (not (close ?u ?vp))))
      (imply (le ?vp ?u) (and (conn ?vp ?u) (not (close ?vp ?u)))))
    :effect (and
      (when (le ?u ?v)  (not (close ?u ?v)))
      (when (le ?v ?u)  (not (close ?v ?u)))
      (when (le ?u ?vp) (close ?u ?vp))
      (when (le ?vp ?u) (close ?vp ?u))))
)

; problem
(define (problem disnet68n) (:domain dntp)
(:objects
	S3 S4 S5 S6 S7 S8 S9 S10 S11 S12 - secondary
	P1 P2 - primary
)
(:init
	(conn S3 P1)
	(conn S3 S6)
	(conn S4 S7)
	(conn S4 S11)
	(conn S5 P2)
	(conn S5 S9)
	(conn S6 P2)
	(conn S7 S12)
	(conn S8 S10)
	(conn S8 S11)
	(conn S9 S10)
	(conn S12 P1)
	(close S3 P1)
	(close S4 S7)
	(close S5 P2)
	(close S5 S9)
	(close S6 P2)
	(close S7 S12)
	(close S8 S10)
	(close S8 S11)
	(close S9 S10)
	(close S12 P1)
	(buildable S4 S8)
	(buildable S4 S12)
	(buildable S7 P1)
	(buildable S7 S11)
	(buildable S9 S11)
	(buildable S10 P2)
	(mutable S4 S7)
	(mutable S4 S11)
	(mutable S7 S12)
	(mutable S8 S11)
	(mutable S9 S10)
	(le P1 P2)
	(le S3 P1)
	(le S3 P2)
	(le S3 S4)
	(le S3 S5)
	(le S3 S6)
	(le S3 S7)
	(le S3 S8)
	(le S3 S9)
	(le S3 S10)
	(le S3 S11)
	(le S3 S12)
	(le S4 P1)
	(le S4 P2)
	(le S4 S5)
	(le S4 S6)
	(le S4 S7)
	(le S4 S8)
	(le S4 S9)
	(le S4 S10)
	(le S4 S11)
	(le S4 S12)
	(le S5 P1)
	(le S5 P2)
	(le S5 S6)
	(le S5 S7)
	(le S5 S8)
	(le S5 S9)
	(le S5 S10)
	(le S5 S11)
	(le S5 S12)
	(le S6 P1)
	(le S6 P2)
	(le S6 S7)
	(le S6 S8)
	(le S6 S9)
	(le S6 S10)
	(le S6 S11)
	(le S6 S12)
	(le S7 P1)
	(le S7 P2)
	(le S7 S8)
	(le S7 S9)
	(le S7 S10)
	(le S7 S11)
	(le S7 S12)
	(le S8 P1)
	(le S8 P2)
	(le S8 S9)
	(le S8 S10)
	(le S8 S11)
	(le S8 S12)
	(le S9 P1)
	(le S9 P2)
	(le S9 S10)
	(le S9 S11)
	(le S9 S12)
	(le S10 P1)
	(le S10 P2)
	(le S10 S11)
	(le S10 S12)
	(le S11 P1)
	(le S11 P2)
	(le S11 S12)
	(le S12 P1)
	(le S12 P2)
)
(:goal
	(and
		(conn S3 P1)
		(conn S3 S6)
		(conn S4 S8)
		(conn S4 S12)
		(conn S5 P2)
		(conn S5 S9)
		(conn S6 P2)
		(conn S7 P1)
		(conn S7 S11)
		(conn S8 S10)
		(conn S9 S11)
		(conn S10 P2)
		(conn S12 P1)
		(not (conn S4 S7))
		(not (conn S4 S11))
		(not (conn S7 S12))
		(not (conn S8 S11))
		(not (conn S9 S10))
		(close S3 P1)
		(close S4 S12)
		(close S5 P2)
		(close S5 S9)
		(close S6 P2)
		(close S7 P1)
		(close S7 S11)
		(close S8 S10)
		(close S10 P2)
		(close S12 P1)
		(not (close S3 S6))
		(not (close S4 S8))
		(not (close S9 S11))
	)
)
)

; plan
1. (insp s10 p2)
   added: (conn s10 p2) (full s10)
   goals met: 17 of 31
2. (inss s9 s11)
   added: (conn s9 s11) (full s9) (full s11)
   goals met: 18 of 31
3. (inss s4 s12)
   added: (conn s4 s12) (full s4) (full s12)
   goals met: 19 of 31
4. (insp s7 p1)
   added: (conn s7 p1) (full s7)
   goals met: 20 of 31
5. (sw s10 s9 p2)
   deleted: (close s9 s10)
   added: (close s10 p2)
   goals met: 21 of 31
6. (dels s9 s10)
   deleted: (conn s9 s10) (full s9) (full s10)
   added: (rem s9 s10)
   goals met: 22 of 31
7. (sw s7 s12 p1)
   deleted: (close s7 s12)
   added: (close s7 p1)
   goals met: 23 of 31
8. (sw s4 s7 s12)
   deleted: (close s4 s7)
   added: (close s4 s12)
   goals met: 24 of 31
9. (dels s4 s7)
   deleted: (conn s4 s7) (full s4) (full s7)
   added: (rem s4 s7)
   goals met: 25 of 31
10. (inss s4 s8)
   added: (conn s4 s8) (full s4) (full s8)
   goals met: 26 of 31
11. (dels s4 s11)
   deleted: (conn s4 s11) (full s4) (full s11)
   added: (rem s4 s11)
   goals met: 27 of 31
12. (inss s7 s11)
   added: (conn s7 s11) (full s7) (full s11)
   goals met: 28 of 31
13. (dels s7 s12)
   deleted: (conn s7 s12) (full s7) (full s12)
   added: (rem s7 s12)
   goals met: 29 of 31
14. (sw s11 s8 s7)
   deleted: (close s8 s11)
   added: (close s7 s11)
   goals met: 30 of 31
15. (dels s8 s11)
   deleted: (conn s8 s11) (full s8) (full s11)
   added: (rem s8 s11)
   goals met: 31 of 31
